Revit 2024 API
PartMaker.GetSourceElementIds Method
 Get the source elements for the PartMaker.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ICollection<LinkElementId> GetSourceElementIds()
Visual Basic
Public Function GetSourceElementIds As ICollection(Of LinkElementId)
Visual C++
public:
ICollection<LinkElementId^>^ GetSourceElementIds()
Return Value
 Elements that are the sources for this PartMaker.
See Also
PartMaker Class
Autodesk.Revit.DB Namespace